[{"id":1616681580,"title":"KPN iTV Kids","dot1":"Bevorderen kijkervaring kinderen","dot2":"UX Research & Concept","dot3":"Native smart TV app","author":"Daniel van der Schuur","date":"March 25, 2021","time":"15:13","thumbnail":"/images/tv-kpn.png","content":"**Introductie**\n\nDe casus omvat de huidige KPN Kids omgeving (beschikbaar op de tabletversies van de app) naar een Native Smart-TV te brengen, en te kijken naar de mogelijkheden van een voice interface.\n\nHet probleem dat zich voordoet is dat de Kids omgeving binnen de KPN iTV app niet geoptimaliseerd is voor zowel de kinderen die niet kunnen lezen, en de ouders die wellicht bepaalde restricties willen opleggen op het kijkgedrag naar de kinderen. \n\nEr bestond al een app voor de tablet. Om een goede baseline te krijgen ben ik begonnen met het onderzoeken van welke componenten en flows er al bestonden in de tablet variant, dit heb ik in beeld gekregen d.m.v. user tests en interviews met de doelgroep.Ik heb verder gekeken naar hoe kinderen (0-6 jaar) naar (smart-)televisies. Dit heb ik gedaan door middel van de fly on the wall en interview methodes, met als eindresultaat een inzicht van de context waarbinnen de probleemstelling zich afspeelt. \n\nOok heb ik gekeken naar hoe andere content providers en concurrenten met deze specifieke doelgroep om. De patterns en functionaliteiten die bruikbaar leken heb ik meegenomen binnen mijn ontwerpen en bevestigd. \n\n\\\n**Design Challenge** \n\n\"Hoe kan ik de KPN iTV Kids omgeving binnen de tablet-app functioneel herontwerpen naar een omgeving binnen de smart tv app en er voor zorgen dat de gebruikservaring van kinderen van 3-6 jaar en dat van hun ouders, positief wordt beïnvloed, zodat zij de omgeving zullen gebruiken?\" \n\n\\\n**Onderzoek**\\\n\\\nDe inzichten die ik heb verzameld heb ik gebundeld in een customer journey, om te bekijken waar de pijnpunten binnen het proces liggen. Dit heb ik zowel gedaan voor traditioneel tv kijken (vanuit een context en gebruikersperspectief) en de bestaande tablet versie van de app.\n\n![Customer Journey Map](/images/customer-journey-map_itv_combined_.png \"Customer Journey Map\")\n\nVerder heb ik de inzichten omgezet naar requirements waar het product aan moet voldoen. Die zie je hieronder. \n\n![Requirement List](/images/requirement_list.png \"Requirement List\")\n\n**Final Product**\n\nDe verschillende features die ik heb uitgewerkt zijn gebaseerd op mijn onderzoeken en op de eerder uitgevoerde user tests. Hetgeen dat hier getoond wordt is het resultaat van een iteratief proces.\n\n* Klappie (Voice Interface)\n* Ouderweergave\n* Kinderweergave\n\nIn de tekst worden de betrokken user requirements benoemd met \\[req; XY].\n\n![Feature Klappie](/images/feature_klappie.png \"Feature Klappie\")\n\n![Feature Ouders](/images/feature_ouders.png \"Feature Ouders\")\n\n![Feature Kinderen](/images/feature_kinderen.png \"Feature Kinderen\")\n\nHet volledige prototype is [hier](https://projects.invisionapp.com/share/YEZ4RAISKVF#/screens) te vinden\\\nww: kidsomgeving","description":"\"Onderzoek en conceptontwikkeling naar de kijkervaring van kinderen \"","mockup":"/images/tv-kpn.png","opdrachtgever":"KPN","duration":"6 Maanden"},{"id":1616600220,"title":"KPN Multiskill","dot1":"Increasing Agile workflow","dot2":"Dashboard design","dot3":"UX Research","author":"Daniel van der Schuur","date":"March 24, 2021","time":"16:37","thumbnail":"/images/kpn-multiskill2.png","content":"**Opdracht**\n\nBinnen de KPN iTV afdeling wordt sinds 3 jaar agile gewerkt. De trekkers van deze transformatie (chapter coaches) concludeerde dat veel medewerkers teveel op 1 vakgebied gefocust zijn en wanneer er iemand uitvalt zijn/haar plek moeilijk te vervangen is. Dit is niet volgens de agile way of working. Hun initiële idee was het maken van verschillende DevOps profielen (Backend, Frontend, Systeem en Video) die allemaal voorzien waren van welke skills (denk aan CD/CI, Videostreams of databases) er voldaan moet worden op elk gewenst niveau.\n\nHet probleem was echter dat dit boekje totaal niet leefde binnen de afdeling en door medewerkers werd ervaren als een checklist voor de Chapter Coaches om te zien wat voor werkniveau de medewerker momenteel bezit, terwijl het tegenovergestelde de bedoeling was.\n\nAan mij de taak om door middel van een digitale oplossing dit probleem te verhelpen en ervoor te zorgen dat het als een bruikbare, nuttige en positieve tool wordt beschouwd.\n\n**Product**\n\nHet product dat hieruit is voort gekomen is de Multiskill DevOps Tool (aan de naam wordt nog gewerkt). Een tool waarmee medewerkers van de iTV afdeling (en later ook andere afdelingen binnen KPN) hun skills kunnen plotten op een de roos (een radarchart) en kunnen vergelijken met alle profielen binnen de afdeling.\n\nGebruikers geven hun huidige level niet direct aan. Dit wordt gedaan binnen de wizard waar zij door middel van verschillende ja-nee vragen over een bepaalde hardskill een level krijgen toegewezen. Wanneer zij bepaalde vragen met nee beantwoorden wordt de subcategorie waar deze vraag over ging opgeslagen en deze wordt gebruikt als input voor het maken van een persoonlijk leerplan. Bij het persoonlijk leerplan geven gebruikers aan naar welk niveau ze binnen een bepaalde tijd willen groeien, en de tool geeft aan aan welke subcategorieën de gebruiker moet gaan werken om dit te voltooien. Idealiter suggereert de tool ook welke cursussen gevolgd kunnen worden.\n\nGebruikers kunnen ook persoonlijke achievements als het behalen van een cursus, volgen van een training of het winnen van een hackathon bijhouden in het badge menu. Deze badges kunnen ook door andere mensen worden toegeschreven.\n\nEn als laatste feature zijn de subskills van de hele afdeling zichtbaar. Gebruikers geven zelf aan of ze hier getoont willen worden, stemmen ze daar mee in worden ze als mentor op dat gebied beschouwt.\n\n\n\n![Multiskill screens](/images/multiskill0.png \"Multiskill screens\")\n\n![Multiskill screens](/images/multiskill1.png \"Multiskill screens\")\n\n![Multiskill screens](/images/multiskill3.png \"Multiskill screens\")","description":"Conceptontwikkeling voor het bevorderen van de agile way of working","mockup":"/images/kpn-multiskill2.png","opdrachtgever":"KPN","duration":"6 Maanden"},{"id":1616510880,"title":"Cern ALICE","dot1":"Streamlining technical workflow","dot2":"Dashboard design","dot3":"UX Research","author":"Daniel van der Schuur","date":"March 23, 2021","time":"15:48","thumbnail":"/images/cern2.png","content":"**Introduction**\n\nCERN is using several detectors to require data from executed experiments, one of those detectors is ALICE (A Large Ion Collider). At the ALICE detector there are several groups active in making sure the data gathered is reliable and secure. One of these groups are ‘shifters’; phd-students who are working at CERN for a few month, making shifts of 8 hours a day. Their task is to control incoming data and writing logs about them. \n\nThe Jiskefet web app is the environment used by the shifters, however due to ALICE being updated, upgraded and repaired the coming 2 years now is the time to improve on the old user unfriendly system. CERN reached out to the University of applied sciences of Amsterdam to make the web-app more modern by using NodeJS, and improving the user experience as well, which is where Bjorn and I came into play. \n\nThe scale and complexity of the content and use cases required a special approach, we decided not to focus on the content as much as you’d want to, because you’re not going to understand it, instead we focussed on the tasks each user needs to complete. \n\n**Research**\n\nDuring the research Bjorn and I divided ourself, Bjorn focussed more on interviews and integration of other platforms and application, while I focussed more on context, users en the current Jiskefet system.\n\nOne of the first problems we encountered was rooted deep in the project; we couldn’t get in contact with users of the old system due to CERN being closed at this time, so we reached out to out few contacts in the organisations and send some interviews to ex-shifters we found on LinkedIn.\n\nOne positive thing is that shifters are often proud of their work time at CERN, so there are a lot of blogs and transparency in their works, I’ll briefly talk about our biggest insights.\n\n**Users**\n\nShifters are phd-student in physics coming from all over the world. Their age vary from 22-60 with the mean around 30. They work at CERN for approx. 3 month, so team is constantly shifting.\n\nNew Shifters have 3 days of training prior to using the application, after that they have a so called ‘shadow shift’ where they are supervised by another shifter. It does occur however that shifters are still clueless with their go abouts, despite the week of training.\n\nThe manager of the bunch is the shift leader. This person is making sure everyone is doing their job properly and is the person that makes and divides tasks.\n\n**Current Bookkeeping System**\n\nThe current system is an ux nightmare. One of our challenges was to research how the user wanted/needed the data to be visualised.\n\n![Logbook old](/images/logbook_old.png \"Logbook old\")\n\n  Context\n\nAfter reading a couple of blogs and interviews we concluded that the stress that comes with being in a control room is pretty significant. People reported they didn’t know where to look for which information since they are looking at 4 monitors at the same time.\n\nShifters work in groups of approx. 8 other shifters and a shift leader, the shift leader is the person who divides the tasks among the shifters. At the start of a new shift the old shifter and new shifter talk each other through the most important event during the last shift, this is done completely vocally.\n\n**Tasks & Content**\n\nWe can’t/don’t understand the vast majority of the data from the previous system. But we do understand the tasks and responsibilities that a shifter must do.\n\n* Create a new log.\n* Check incoming runs.\n* Controle others’ logs.\n\n![Customer Journey CERN](/images/customerjourney_cern.png \"Customer Journey CERN\")\n\n**Design Challenge**\n\n  \"HOW CAN WE MAKE A SHIFT EASIER FOR A CERN SHIFTER BY SUPPLYING HIM/HER WITH THE TOOLS NEEDED AT THE RIGHT TIME?”\n\n**Data Clustering**\n\nOur folks over at CERN decided it would be a good idea to load every run and log with an unlimited and no structure regarding what can be a tag and what can’t. Everyone could made any tag they desired.\n\nI thought this could be done better. I started out with requesting actual log data which I spit through to look for similarities, connections and basic structure and I found out each log had 2 components: an action and an object which the action was related to. I set up to lists to bring these together for easy and logical clustering for shifters.\n\n**Subject**\n\n* Hardware\n* Software\n* Server\n* Electricity\n* Boards\n* Other\n\n**Action**\n\n* Success\n* Failed\n* Error\n* Movement (Digital)\n* Movement (Physical)\n* Installation\n* Update\n* Other\n\n**Screens & New Implementations**\n\nApart from basic UX improvements such as icons, bringing the useful data forward, color coding and making the application more personal by using profile pictures and actual names, we also created a few new features which would improve the workflow of a shifter.\n\nOne of our key founding was that shifters have a transfer conversation when one shift ends and the other starts. This was done vocally and shifters wrote down the most important things. We concluded this could be beneficial in the workflow of the app, so we created an ‘start of shift’-wizard which the two shifters could go through important logs and runs. Afterwards these could be saved as To-Do tasks.\n\nOne of which is the dashboard home screen. This is the screen the Shifter will look at 80% of the time, so we wanted to let the user access all the ‘priority tasks’.\n\nWe also implemented a notification system which allows a shifter to keep track of changes, interactions or follow ups on his previous logs.\n\nBelow you can see how the application will be used by shifters, to see the entire concept [click here](https://invis.io/K4SP8RKVHFM#/370809877_Important_Shift_Previous)\n\n[Invision Prototype](https://invis.io/K4SP8RKVHFM#/370809877_Important_Shift_Previous)\n\n![New Log](/images/micro_interaction_createnewlog.gif \"New Log\")\n\n![Notification](/images/notification.gif \"Notification\")\n\n**MVP**\n\n[Github Repository](https://github.com/dorusth/Jiskefet) created by our developers and will be used as a base for the new app at CERN.","description":"Onderzoek en UX redesign  managementtool ALICE reactor","mockup":"/images/cern2.png","opdrachtgever":"Cern ALICE","duration":"6 Weken"},{"id":1616424540,"title":"Cropplay","dot1":"D3 & React","dot2":"Interactive Inforgraphic","dot3":"UX Research","author":"Daniel van der Schuur","date":"March 22, 2021","time":"15:49","thumbnail":"/images/utz2.png","content":"**Debriefing**\n\nHelp UTZ/Rainforest Alliance om beter te begrijpen en uit te leggen hoe kleine boeren rond komen. En hoe UTZ/Rainforest alliance ze kan helpen. Beschrijf de sociale demografische en economische eigenschappen van een boeren huishouden in een bepaald land, bepaalde periode of een bepaald gewas.\\\n\\\nWij hebben gekozen voor het land Ghana met als hoofdgewas cacao. Belangrijk is dat wij niet het verhaal gaan vertellen van de ‘perfecte boer’. Een perfecte boer is voro UTZ niet interessant, want daar hoeven zijn niet te ondersteunen.\n\n**Data**\n\nDe dataset die we hebben gebruikt was de [KIT - \"Demystifying the Cocoa Sector in Ghana and Côte d’Ivoire\"](https://www.kit.nl/project/demystifying-cocoa-sector/) Dataset. De dataset is een enquete afgenomen over 10.000 cacoaboeren in Ghana en Ivoorkust.\n\nEen gigantische dataset, met veel afwezige data, gigantische outlyers door de ietwat onduidelijke vraagstelling van de enquete. Na veel gereken en nagedacht te hebben over de meest passende weergave is de dataset enorm geslonken, en konden we ermee aan de slag.\n\nWe hebben ervoor gekozen om te gaan werken met het Poverty Probability Index (PPI). Het PPI is gebaseerd op sociale demografie en de kwaliteit van leven. Dit wordt bepaald aan de hand van 10 vragen, bijvoorbeeld: \"Van welk materiaal is je dak gemaakt?\", \"Hoeveel kinderen gaan er naar school in je huishouden?\" en \"Wat voor sanitaire faciliteit wordt er gebruikt in het huishouden?\".\n\nIedere boer heeft dus een PPI score toegewezen gekregen, deze hebben wij gebruikt om de percentielen te berekenen om zo het land en gewassen te kunnen verdelen.\n\n\n\n![](/images/utz-end.png)\n\n**Product**\n\n[Het interactieve eindproduct](https://sjerrietukkel.github.io/utz/)","description":"Ontwikkeling interactieve infographic naar leefbaarheid UTZ boeren","mockup":"/images/utz2.png","opdrachtgever":"UTZ","duration":"8 Weken"},{"id":1615498620,"title":"Huisarrest","dot1":"Online Escape Room","dot2":"UX & Development","dot3":"React Game Omgeving","author":"Daniel van der Schuur","date":"March 11, 2021","time":"22:37","thumbnail":"/images/huisarrest2.png","content":"# Hey\n\nHoe gaat het er mee?","description":"Concept & development online escape room","mockup":"/images/huisarrest2.png","opdrachtgever":"Huisarrest","duration":"3 weken"}]